; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	spectrograph1 - mode
	infrared0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	Star7 - direction
	GroundStation2 - direction
	Star5 - direction
	Star6 - direction
	GroundStation3 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 Star7)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 Star6)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star5)
	(supports instrument8 infrared0)
	(calibration_target instrument8 GroundStation3)
	(calibration_target instrument8 Star6)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star15)
)
(:goal (and
	(pointing satellite1 GroundStation2)
	(have_image Planet8 spectrograph1)
	(have_image Star9 infrared0)
	(have_image Phenomenon10 infrared0)
	(have_image Star11 infrared0)
	(have_image Phenomenon12 spectrograph1)
	(have_image Phenomenon13 spectrograph1)
	(have_image Star14 infrared0)
	(have_image Star15 infrared0)
	(have_image Phenomenon16 spectrograph1)
	(have_image Phenomenon17 infrared0)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 11
2. (calibrate satellite1 instrument3 star7)
   added: (calibrated instrument3)
   goals met: 0 of 11
3. (turn_to satellite1 phenomenon17 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon17)
   goals met: 0 of 11
4. (take_image satellite1 phenomenon17 instrument3 infrared0)
   added: (have_image phenomenon17 infrared0)
   goals met: 1 of 11
5. (turn_to satellite1 phenomenon16 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 11
6. (take_image satellite1 phenomenon16 instrument3 spectrograph1)
   added: (have_image phenomenon16 spectrograph1)
   goals met: 2 of 11
7. (turn_to satellite1 phenomenon13 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 11
8. (take_image satellite1 phenomenon13 instrument3 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 3 of 11
9. (turn_to satellite1 phenomenon12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 11
10. (take_image satellite1 phenomenon12 instrument3 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 4 of 11
11. (turn_to satellite1 phenomenon10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 11
12. (take_image satellite1 phenomenon10 instrument3 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 5 of 11
13. (turn_to satellite1 planet8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet8)
   goals met: 5 of 11
14. (take_image satellite1 planet8 instrument3 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 6 of 11
15. (turn_to satellite1 star11 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star11)
   goals met: 6 of 11
16. (take_image satellite1 star11 instrument3 infrared0)
   added: (have_image star11 infrared0)
   goals met: 7 of 11
17. (turn_to satellite1 star14 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star14)
   goals met: 7 of 11
18. (take_image satellite1 star14 instrument3 infrared0)
   added: (have_image star14 infrared0)
   goals met: 8 of 11
19. (turn_to satellite1 star15 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star15)
   goals met: 8 of 11
20. (take_image satellite1 star15 instrument3 infrared0)
   added: (have_image star15 infrared0)
   goals met: 9 of 11
21. (turn_to satellite1 star9 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star9)
   goals met: 9 of 11
22. (take_image satellite1 star9 instrument3 infrared0)
   added: (have_image star9 infrared0)
   goals met: 10 of 11
23. (turn_to satellite1 groundstation2 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation2)
   goals met: 11 of 11
